<script setup>

</script>

<template>
    <div class="content">
        <div class="desc">
            <p>ТОКИО-CITY — это современные городские рестораны с универсальной кухней. В нашем меню переплетаются элементы японской, итальянской, восточноевропейской, китайской и других кухонь. Более 500 блюд и напитков, новинки и хиты ждут вас! Приходите в гости или оформляйте заказ еды с доставкой: курьерская служба ресторана работает по всем районам Санкт-Петербурга.
                Дизайн наших ресторанов выполнен в современном стиле. Сочетание неоновых вывесок, ярких цветовых акцентов, художественных панно и граффити отражает нашу концепцию заведения, вдохновлённого городом. Эклектичные интерьеры подойдут как для шумных вечеринок в кругу друзей, так и для уютных посиделок. У нас проводят время семьи с детьми, влюблённые пары, родственники и коллеги. В наших ресторанах вы можете провести бизнес-ланч, устроить романтический вечер или отпраздновать важное событие: юбилей, годовщину, свадьбу. У нас регулярно проходят банкеты: мы дарим скидки на день рождения и в особые даты. В ТОКИО-CITY постоянно устраиваются вечерние мероприятия, DJ-сеты, выступления артистов и караоке — мы знаем всё о качественном отдыхе!</p>
        </div>
        <img src="../../../img/KEV_1837.jpg">
    </div>
</template>

<style scoped>
    .content {
        @apply w-full  h-96 mt-12 relative
    }
    .desc{
        border-radius: 0 40px 40px 0;
        @apply border border-slate-300 w-2/3 h-full p-5 inline-block shadow-xl

    }
    p {
        @apply leading-relaxed text-lg
    }
    img {
        @apply inline-block max-w-prose absolute right-2 top-0 h-full rounded-3xl shadow-xl
    }
</style>
